ma-hy15/nrf52832_ble_nus/main.c
/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);

    //err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
    //APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
//    uint32_t err_code;
    switch (event)
    {
//        case BSP_EVENT_SLEEP:
//            sleep_mode_enter();
//            break;

//        case BSP_EVENT_DISCONNECT:
//            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
//            if (err_code != NRF_ERROR_INVALID_STATE)
//            {
//                APP_ERROR_CHECK(err_code);
//            }
//            break;

//        case BSP_EVENT_WHITELIST_OFF:
//            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
//            {
//                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
//                if (err_code != NRF_ERROR_INVALID_STATE)
//                {
//                    APP_ERROR_CHECK(err_code);
//                }
//            }
//            break;

        default:
            break;
    }
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_FAST_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_FAST_DURATION;
		init.config.ble_adv_slow_enabled  = true;
		init.config.ble_adv_slow_interval = APP_ADV_SLOW_INTERVAL;
		init.config.ble_adv_slow_timeout	= APP_ADV_SLOW_DURATION;
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *3
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    //uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
		uint32_t err_code = bsp_init(BSP_INIT_LEDS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}

static void wdt_timer_handler(void * p_context)
{
	static uint8_t wdt_sec=0;
	wdt_sec++;
	nrfx_wdt_channel_feed(my_channel_id);
	nrf_gpio_pin_toggle(TPL5010_DONE);
	//NRF_LOG_INFO("FEED DOG:%d",wdt_sec);
}

void app_timer_config()
{
		ret_code_t err_code;
	  err_code = app_timer_create(&wdt_timer_speed, APP_TIMER_MODE_REPEATED, wdt_timer_handler);
	  APP_ERROR_CHECK(err_code);
		APP_ERROR_CHECK(app_timer_start(wdt_timer_speed, APP_TIMER_TICKS(1000),NULL));
}

//定时器事件回调函数
void my_timer_event_handler(nrf_timer_event_t event_type,void* p_context)
{
	switch(event_type)
	{
		case NRF_TIMER_EVENT_COMPARE0:
			nrf_gpio_pin_toggle(LED_3);
			break;
		default:
			break;
	}
}
//定时器配置函数
void timer_config()
{
	uint32_t err_code=NRF_SUCCESS;
	//uint32_t time_ms=1;
	uint32_t time_us=500;
	uint32_t ticks;

	nrfx_timer_config_t my_timer_config = NRFX_TIMER_DEFAULT_CONFIG; // 先使用默认配置，然后更改
	my_timer_config.frequency = NRF_TIMER_FREQ_1MHz; // 在头文件nrf_timer.h中
	err_code=nrfx_timer_init(&MY_TIMER,&my_timer_config,my_timer_event_handler); //无论什么模式，都要给出事件回调函数，即使用不到，也要定义
	APP_ERROR_CHECK(err_code);
	
	//ticks=nrfx_timer_ms_to_ticks(&MY_TIMER,time_ms);
	ticks=nrfx_timer_us_to_ticks(&MY_TIMER,time_us);
	nrfx_timer_extended_compare(&MY_TIMER,NRF_TIMER_CC_CHANNEL0,ticks,NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK,false); //最后一项是中断，不开启中断，则没有事件回调
	
	//nrfx_timer_enable(&MY_TIMER);
}

void ave(uint16_t* buffer)
{
	uint32_t tmp1=0;
	uint32_t tmp2=0;
	uint32_t tmp3=0;
	uint32_t tmp4=0;
	for(int i=0;i<SAMPLE_BUFFER_DOTS;i++)
	{
		tmp1 += buffer[i*4];
		tmp2 += buffer[i*4+1];
		tmp3 += buffer[i*4+2];
		tmp4 += buffer[i*4+3];
	}
	ave_data[hc_num][0] =tmp1/SAMPLE_BUFFER_DOTS;
	ave_data[hc_num][1] =tmp2/SAMPLE_BUFFER_DOTS;
	ave_data[hc_num][2] =tmp3/SAMPLE_BUFFER_DOTS;
	ave_data[hc_num][3] =tmp4/SAMPLE_BUFFER_DOTS;
	if(hc_num < HC)
		hc_num++;
	else
		hc_num=0;
}

void rms(uint16_t* buffer)
{
	uint32_t tmp1=0;
	uint32_t tmp2=0;
	uint32_t tmp3=0;
	uint32_t tmp4=0;
	for(int i=0;i<SAMPLE_BUFFER_DOTS;i++)
	{
		tmp1 += ((uint32_t)buffer[i*4])*((uint32_t)buffer[i*4]);
		tmp2 += ((uint32_t)buffer[i*4+1])*((uint32_t)buffer[i*4+1]);
		tmp3 += ((uint32_t)buffer[i*4+2])*((uint32_t)buffer[i*4+2]);
		tmp4 += ((uint32_t)buffer[i*4+3])*((uint32_t)buffer[i*4+3]);
	}
	// 或者直接取平方均值的9-24位（4096=2^12）(计算得500以下的有效值也才相差0.2)
	tmp1 = tmp1/SAMPLE_BUFFER_DOTS;
	tmp1 = tmp1>>8;
	tmp2 = tmp2/SAMPLE_BUFFER_DOTS;
	tmp2 = tmp2>>8;
	tmp3 = tmp3/SAMPLE_BUFFER_DOTS;
	tmp3 = tmp3>>8;
	tmp4 = tmp4/SAMPLE_BUFFER_DOTS;
	tmp4 = tmp4>>8;
	ave_data[hc_num][0] =(uint16_t)tmp1;
	ave_data[hc_num][1] =(uint16_t)tmp2;
	ave_data[hc_num][2] =(uint16_t)tmp3;
	ave_data[hc_num][3] =(uint16_t)tmp4;
//	double temp1 =tmp1/SAMPLE_BUFFER_DOTS;
//	double temp2 =tmp2/SAMPLE_BUFFER_DOTS;
//	double temp3 =tmp3/SAMPLE_BUFFER_DOTS;
//	double temp4 =tmp4/SAMPLE_BUFFER_DOTS;
//	ave_data[hc_num][0] =(uint16_t)((int)(sqrt(temp1)));
//	ave_data[hc_num][1] =(uint16_t)((int)(sqrt(temp2)));
//	ave_data[hc_num][2] =(uint16_t)((int)(sqrt(temp3)));
//	ave_data[hc_num][3] =(uint16_t)((int)(sqrt(temp4)));
	if(hc_num < HC)
		hc_num++;
	else
		hc_num=0;
}

void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
	ret_code_t err_code=NRF_SUCCESS;
	
	if(p_event->type==NRFX_SAADC_EVT_DONE)
	{
		//设置缓存，为下一次采样准备，具体我也不懂
		APP_ERROR_CHECK(nrfx_saadc_buffer_convert(p_event->data.done.p_buffer,SAMPLE_BUFFER_LEN));
		
