ma-hy15/nrf52832_ble_nus/main.c
		//NRF_LOG_INFO("SAADC");
		//ave((uint16_t*)p_event->data.done.p_buffer); 直流磁场API
		rms((uint16_t*)p_event->data.done.p_buffer);
		if(hc_num==0){
			m_adc_evt_counter++;
			length=MIN(m_ble_nus_max_data_len,HC*CHANNEL*2);
			err_code = ble_nus_data_send(&m_nus, (uint8_t*)ave_data, &length, m_conn_handle);
			if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_RESOURCES) &&
				 (err_code != NRF_ERROR_NOT_FOUND) )
			{
					APP_ERROR_CHECK(err_code);
			}
			if (err_code == NRF_SUCCESS)
			{
				//NRF_LOG_INFO("%d:SUCCESS",m_adc_evt_counter);
				m_adv_success_send++;
			}
			else
			{
				//NRF_LOG_INFO("%d:DROP",m_adc_evt_counter);
			}
			if(m_adc_evt_counter==80)
			{
				//NRF_LOG_INFO("RATE: %d/%d",m_adv_success_send,m_adc_evt_counter);
				m_adv_success_send=0;
				m_adc_evt_counter=0;
			}
		}
	}
}

void adc_config()
{
	ret_code_t err_code=NRF_SUCCESS;
	
	//ADC通道配置结构体
	nrf_saadc_channel_config_t channel_config = NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_DIFFERENTIAL(NRF_SAADC_INPUT_AIN0,NRF_SAADC_INPUT_AIN1);
	nrf_saadc_channel_config_t channel_config2 = NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_DIFFERENTIAL(NRF_SAADC_INPUT_AIN3,NRF_SAADC_INPUT_AIN2);
	nrf_saadc_channel_config_t channel_config3 = NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_DIFFERENTIAL(NRF_SAADC_INPUT_AIN4,NRF_SAADC_INPUT_AIN5);
	nrf_saadc_channel_config_t channel_config4 = NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_DIFFERENTIAL(NRF_SAADC_INPUT_AIN7,NRF_SAADC_INPUT_AIN6);
	//初始化SAADC，注册事件回调函数 
	err_code=nrf_drv_saadc_init(NULL,saadc_callback);
	APP_ERROR_CHECK(err_code);
	//初始化SAADC通道0
	err_code=nrfx_saadc_channel_init(0,&channel_config);
	APP_ERROR_CHECK(err_code);
	//初始化SAADC通道1
	err_code=nrfx_saadc_channel_init(1,&channel_config2);
	APP_ERROR_CHECK(err_code);	
		//初始化SAADC通道2
	err_code=nrfx_saadc_channel_init(2,&channel_config3);
	APP_ERROR_CHECK(err_code);	
		//初始化SAADC通道3
	err_code=nrfx_saadc_channel_init(3,&channel_config4);
	APP_ERROR_CHECK(err_code);	
	//注册双缓存
	err_code=nrfx_saadc_buffer_convert(m_buffer_pool[0],SAMPLE_BUFFER_LEN);
	APP_ERROR_CHECK(err_code);
	err_code=nrfx_saadc_buffer_convert(m_buffer_pool[1],SAMPLE_BUFFER_LEN);
	APP_ERROR_CHECK(err_code);
	
}

//void feed_tpl5010()
//{
//		nrf_gpio_pin_set(TPL5010_DONE);
//		nrf_delay_ms(50);
//		nrf_gpio_pin_clear(TPL5010_DONE);
//}

void ppi_config()
{
	uint32_t err_code=NRF_SUCCESS;
	
	//初始化PPI模块
	err_code=nrf_drv_ppi_init();
	APP_ERROR_CHECK(err_code);
	
	//申请PPI通道
	err_code = nrfx_ppi_channel_alloc(&my_ppi_channel);
	APP_ERROR_CHECK(err_code);
	
	//设置通道的TEP和EEP
	err_code = nrfx_ppi_channel_assign(my_ppi_channel,nrfx_timer_compare_event_address_get(&MY_TIMER,NRF_TIMER_CC_CHANNEL0),nrfx_saadc_sample_task_get());
	APP_ERROR_CHECK(err_code);
	
	
	//设置次级任务端点
	//err_code = nrfx_ppi_channel_fork_assign(my_ppi_channel,nrfx_gpiote_out_task_addr_get(LED_4));
	//APP_ERROR_CHECK(err_code);
	
//	//使能PPI通道
//	err_code = nrfx_ppi_channel_enable(my_ppi_channel);
//	APP_ERROR_CHECK(err_code);
	
	//PPI是硬件活动，与中断/事件回调无关！不冲突！(GPIOTE会使得回调函数里对GPIOTE端口的GPIO操作失败,这是BUTTON导致的)
}

//WDT 中断只有2个32.768kHz的时钟周期，之后系统复位
void wdt_event_handler(void)
{
	bsp_board_leds_on();
}

void wdt_config()
{
	uint32_t err_code=NRF_SUCCESS;
	
	// 喂狗设置，默认2000ms喂一次
	nrfx_wdt_config_t config = NRFX_WDT_DEAFULT_CONFIG;
	err_code=nrfx_wdt_init(&config,wdt_event_handler);
	APP_ERROR_CHECK(err_code);
	
	// 申请喂狗通道
	err_code = nrfx_wdt_channel_alloc(&my_channel_id);
	APP_ERROR_CHECK(err_code);
	
	nrf_gpio_cfg_output(TPL5010_DONE);
	nrf_gpio_pin_clear(TPL5010_DONE);
	
	//开始计数，不可终止，所以该初始化函数最好最后执行
	nrfx_wdt_enable();
}

void sensor_init()
{
	if(!sensor_state){
		adc_config();
		timer_config();
		ppi_config();
		sensor_state=true;
	}
	
}
void sensor_uninit()
{
	if(sensor_state){
	nrf_drv_ppi_uninit();
	nrfx_timer_uninit(&MY_TIMER);
	nrfx_saadc_uninit();
	sensor_state = false;
	}
}

/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;
		
	
		nrf_delay_ms(1000);
    // Initialize.
    // uart_init();
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds); //偷偷的对button进行了gpiote port初始化
	
		//feed_tpl5010();
	
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
		
    // Start execution.
    //printf("\r\nUART started.\r\n");
    //NRF_LOG_INFO("Debug logging for UART over RTT started.");
		
		app_timer_config();
		wdt_config();
	
		advertising_start();
		//throughput_test();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
